[
  {
    "id": "declarative-spa",
    "name": "Declarative Single-Page Application",
    "summary": "A fully interactive SPA using only declarative HTML with zero JavaScript bootstrap or custom elements. Demonstrates maximum interactivity through pure markup and Web Everything standards.",
    "description": "<h2>Concept</h2><p>This demo explores the limits of declarative, zero-JavaScript interactivity by building a complete single-page application that is served as static HTML in the initial HTTP request. No framework bootstrap, no custom elements registration, no JavaScript imports—just HTML enhanced with Web Everything attributes.</p><h3>Key Constraints</h3><ul><li><strong>No JavaScript Bootstrap:</strong> The HTML document loads and is interactive immediately without waiting for JS bundles.</li><li><strong>No Custom Elements:</strong> Uses only native HTML elements enhanced with behavioral attributes.</li><li><strong>Server-Rendered:</strong> The complete application structure is returned in the initial HTTP response.</li><li><strong>Progressive Enhancement:</strong> Core functionality works before any JavaScript loads; behaviors enhance the experience.</li></ul><h3>Interactive Features</h3><ul><li><strong>State Management:</strong> Declarative context definitions using <code>&lt;script type=\"context\"&gt;</code></li><li><strong>Data Binding:</strong> Two-way binding with <code>bind-text</code>, <code>bind-value</code> attributes</li><li><strong>Event Handling:</strong> Actions triggered via <code>on:click</code>, <code>on:input</code> without inline JavaScript</li><li><strong>Conditional Rendering:</strong> Elements shown/hidden based on context state</li><li><strong>List Rendering:</strong> Dynamic lists generated from context data</li><li><strong>Form Validation:</strong> Declarative validation rules without custom code</li></ul><h3>Technical Approach</h3><p>The demo leverages Web Contexts for state management, Web Directives for declarative behaviors, and Web Injectors for dependency resolution—all configured through HTML attributes and inline context definitions. Behaviors are attached via attribute-based protocols that activate on page load, transforming static HTML into an interactive application.</p>",
    "status": "draft",
    "liveUrl": "http://localhost:3000/demos/declarative-spa.html",
    "projects": [
      "webcontexts",
      "webdirectives",
      "webinjectors",
      "webstates"
    ]
  }
]
